Revit 2027 API
BuiltInFailures.StairRampFailures.RailPathCloseLoopForExtensionWarning Property
 The rail path is closed at the start and end path point for extension creation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailPathCloseLoopForExtensionWarning { get; }
Public Shared ReadOnly Property RailPathCloseLoopForExtensionWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailPathCloseLoopForExtensionWarning {
	FailureDefinitionId^ get ();
}
static member RailPathCloseLoopForExtensionWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace